"An error occurred. Please try again." = "An error occurred. Please try again.";

"Card brand was not updated. Please try again." = "Card brand was not updated. Please try again.";

"Close" = "Close";

"Default payment method was not updated. Please try again." = "Default payment method was not updated. Please try again.";

"Scan Card" = "Scan Card";

"Scan card" = "Scan card";

"The IBAN you entered is invalid." = "The IBAN you entered is invalid.";

"There was an error processing your card -- try again in a few seconds" = "There was an error processing your card - please try again in a few seconds";

"There was an unexpected error -- try again in a few seconds" = "There was an unexpected error - please try again in a few seconds";

"Try again" = "Try again";

"We use Stripe to verify your card details. Stripe may use and store your data according its privacy policy. <a href='https://support.stripe.com/questions/stripes-card-image-verification'><u>Learn more</u></a>" = "We use Stripe to verify your card details. Stripe may use and store your data according its privacy policy. <a href='https://support.stripe.com/questions/stripes-card-image-verification'><u>Learn more</u></a>";

"Your card has expired" = "Your card has expired";

"Your card was declined" = "Your card has been declined";

"Your card's expiration month is invalid" = "Your card's expiry month is invalid";

"Your card's expiration year is invalid" = "Your card's expiry year is invalid";

"Your card's number is invalid" = "Your card's number is invalid";

"Your card's security code is invalid" = "Your card's security code is invalid";

"Your name is invalid." = "Your name is invalid.";

"Your payment method was declined." = "Your payment method was declined.";
